<?php

if (!defined('BASEPATH'))
    exit('No direct script access allowed');

class Err {

    public static $arErrCode = array(
        'ERR_OK' => '0000', //成功
        //以下为服务端错误码 
        '0000' => 'success',
        
        '1001' => '参数为空',
        '1002' => '参数非法',
        '1003' => '签名校验不通过',
        '1004' => '没有可查询的数据',
        '1005' => '数据库一般性错误',
        '1006' => '接口超时',
        '1007' => '数据库插入错误',
        '1008' => '数据库更新错误',
        '1099' => '未知错误',
        
        '1101' => '已提交，请勿重复输入',
        '1102' => '手机号码非法',

        '3001' => '搜索信息为空',
        '3002' => '反馈结果不空',
    );

}
